In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("F:\Data Science Course\Joyita\insurance.csv")

In [3]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
data.charges.mean()

13270.422265141257

In [5]:
data.groupby("region").charges.mean()

region
northeast    13406.384516
northwest    12417.575374
southeast    14735.411438
southwest    12346.937377
Name: charges, dtype: float64

In [6]:
data.charges.median()

9382.033

In [7]:
data.groupby("region").charges.median()

region
northeast    10057.652025
northwest     8965.795750
southeast     9294.131950
southwest     8798.593000
Name: charges, dtype: float64

In [8]:
data.groupby("region").charges.min()

region
northeast    1694.7964
northwest    1621.3402
southeast    1121.8739
southwest    1241.5650
Name: charges, dtype: float64

In [9]:
data.groupby("region").charges.max()

region
northeast    58571.07448
northwest    60021.39897
southeast    63770.42801
southwest    52590.82939
Name: charges, dtype: float64

In [10]:
data[data["region"] == "northeast"].charges.mean()

13406.3845163858

In [11]:
data[data["region"] == "northeast"].charges.min()

1694.7964

In [12]:
data[data["region"] == "northeast"].charges.max()

58571.074479999996

In [13]:
data.charges.agg(["mean", "median", "min", "max", "count"])

mean      13270.422265
median     9382.033000
min        1121.873900
max       63770.428010
count      1338.000000
Name: charges, dtype: float64

In [14]:
data.charges.describe()

count     1338.000000
mean     13270.422265
std      12110.011237
min       1121.873900
25%       4740.287150
50%       9382.033000
75%      16639.912515
max      63770.428010
Name: charges, dtype: float64

In [15]:
data.groupby("region").charges.agg(["mean", "median", "min", "max", "count"])

                   mean        median        min          max  count
region
northeast  13406.384516  10057.652025  1694.7964  58571.07448    324
northwest  12417.575374   8965.795750  1621.3402  60021.39897    325
southeast  14735.411438   9294.131950  1121.8739  63770.42801    364
southwest  12346.937377   8798.593000  1241.5650  52590.82939    325

In [16]:
data.groupby("region").mean()

                 age        bmi  children       charges
region
northeast  39.268519  29.173503  1.046296  13406.384516
northwest  39.196923  29.199785  1.147692  12417.575374
southeast  38.939560  33.355989  1.049451  14735.411438
southwest  39.455385  30.596615  1.141538  12346.937377

In [17]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [18]:
data.region.describe()

count          1338
unique            4
top       southeast
freq            364
Name: region, dtype: object

In [20]:
data.region.value_counts()

southeast    364
northwest    325
southwest    325
northeast    324
Name: region, dtype: int64

In [21]:
data.region.value_counts(normalize=True)        # Normalize ==> 0 - 1  Standardize ==> -1 to 1    #Normalize = count/total rows

southeast    0.272048
northwest    0.242900
southwest    0.242900
northeast    0.242152
Name: region, dtype: float64

In [22]:
data.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [23]:
data.region.nunique()

4

In [24]:
data.children.unique()

array([0, 1, 3, 2, 5, 4], dtype=int64)

In [25]:
data.children.nunique()

6

In [26]:
pd.crosstab(data.region, data.children)

children     0   1   2   3  4  5
region
northeast  147  77  51  39  7  3
northwest  132  74  66  46  6  1
southeast  157  95  66  35  5  6
southwest  138  78  57  37  7  8

In [27]:
pd.crosstab(data.region, data.sex)

sex        female  male
region
northeast     161   163
northwest     164   161
southeast     175   189
southwest     162   163

In [28]:
pd.crosstab(data.age, data.children)

children   0   1   2  3  4  5
age
18        51   9   6  2  1  0
19        50  11   5  1  0  1
20        17   6   3  1  0  2
21        16   5   5  1  1  0
22        18   4   2  4  0  0
23        13   6   5  4  0  0
24        23   1   1  2  1  0
25        12   6   4  3  2  1
26        10   9   7  1  1  0
27        14   6   3  5  0  0
28        10   6   8  3  0  1
29         9   6   9  2  1  0
30         5  10   4  8  0  0
31         8   7   7  4  0  1
32         7  10   5  3  1  0
33         8   7   5  3  1  2
34         7  11   5  3  0  0
35         2  11   6  5  1  0
36        10   6   3  5  1  0
37         7   4   9  4  1  0
38         4   9   8  4  0  0
39         4   5   7  4  1  4
40         4  11   6  4  2  0
41         5  12   6  3  0  1
42        10   8   8  1  0  0
43         6   6   9  5  0  1
44         6  10  10  1  0  0
45         9   4  11  4  0  1
46         5  10   7  6  0  1
47         4  16   4  4  1  0
48        10   9   4  3  3  0
49         7   9   6  4  1  1
50         9   8   7  4  1  0
51        10  11   4  3  1  0
52        10   4   8  6  0  1
53        10   7   5  6  0  0
54         8   8   4  8  0  0
55        13   5   4  4  0  0
56        16   4   3  2  1  0
57        16   6   3  0  1  0
58        21   2   2  0  0  0
59        10   6   3  6  0  0
60        19   2   0  2  0  0
61        15   3   2  2  1  0
62        16   3   2  2  0  0
63        17   2   1  3  0  0
64        13   3   4  2  0  0

In [31]:
data.isnull().head()

     age    sex    bmi  children  smoker  region  charges
0  False  False  False     False   False   False    False
1  False  False  False     False   False   False    False
2  False  False  False     False   False   False    False
3  False  False  False     False   False   False    False
4  False  False  False     False   False   False    False

In [30]:
data.notnull().head()

    age   sex   bmi  children  smoker  region  charges
0  True  True  True      True    True    True     True
1  True  True  True      True    True    True     True
2  True  True  True      True    True    True     True
3  True  True  True      True    True    True     True
4  True  True  True      True    True    True     True

In [32]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [33]:
data.isnull().sum() / len(data)

age         0.0
sex         0.0
bmi         0.0
children    0.0
smoker      0.0
region      0.0
charges     0.0
dtype: float64

In [57]:
df = pd.read_csv("http://bit.ly/uforeports")

In [35]:
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [37]:
df.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [38]:
df.notnull().head()

   City  Colors Reported  Shape Reported  State  Time
0  True            False            True   True  True
1  True            False            True   True  True
2  True            False            True   True  True
3  True            False            True   True  True
4  True            False            True   True  True

In [39]:
df.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [40]:
df.isnull().sum() / len(df)

City               0.001371
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [41]:
df.shape

(18241, 5)

In [42]:
df[df.City.notnull()]

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [43]:
df.dropna(how="any").shape

(2486, 5)

In [44]:
df.dropna(how="all").shape

(18241, 5)

In [45]:
df.dropna(subset=["City", "Shape Reported"], how="any").shape

(15576, 5)

In [59]:
df["Shape Reported"].value_counts()

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
PYRAMID         1
HEXAGON         1
DOME            1
FLARE           1
Name: Shape Reported, dtype: int64

In [58]:
df["Shape Reported"].value_counts(dropna=False)

LIGHT        2803
NaN          2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
PYRAMID         1
HEXAGON         1
FLARE           1
DOME            1
Name: Shape Reported, dtype: int64

In [60]:
df["Shape Reported"].fillna(value="Various", inplace=True)

In [61]:
df.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported         0
State                  0
Time                   0
dtype: int64

In [62]:
df["Shape Reported"].value_counts()

LIGHT        2803
Various      2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
DOME            1
HEXAGON         1
PYRAMID         1
FLARE           1
Name: Shape Reported, dtype: int64

In [63]:
data = pd.read_csv("F:\Data Science Course\Joyita\insurance.csv")

In [64]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [65]:
data.index

RangeIndex(start=0, stop=1338, step=1)

In [66]:
data.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [67]:
data.set_index("age", inplace=True)

In [68]:
data.head()

        sex     bmi  children smoker     region      charges
age
19   female  27.900         0    yes  southwest  16884.92400
18     male  33.770         1     no  southeast   1725.55230
28     male  33.000         3     no  southeast   4449.46200
33     male  22.705         0     no  northwest  21984.47061
32     male  28.880         0     no  northwest   3866.85520

In [69]:
data.index

Int64Index([19, 18, 28, 33, 32, 31, 46, 37, 37, 60,
            ...
            23, 52, 57, 23, 52, 50, 18, 18, 21, 61],
           dtype='int64', name='age', length=1338)

In [70]:
data.reset_index(inplace=True)

In [71]:
data.index

RangeIndex(start=0, stop=1338, step=1)

In [72]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

ILOC, LOC, IX

In [ ]:
# loc ==> label based (rows (including:including) , columns (including:including) )

In [73]:
data.loc[2, "sex"]

'male'

In [74]:
data.loc[3:8, "sex":"smoker"]

      sex     bmi  children smoker
3    male  22.705         0     no
4    male  28.880         0     no
5  female  25.740         0     no
6  female  33.440         1     no
7  female  27.740         3     no
8    male  29.830         2     no

In [75]:
data.loc[3:8, ["sex", "smoker"]]

      sex smoker
3    male     no
4    male     no
5  female     no
6  female     no
7  female     no
8    male     no

In [ ]:
# iloc ==> index based (rows (including:excluding) , columns (including:excluding) )

In [76]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [77]:
data.iloc[3:5]

   age   sex     bmi  children smoker     region      charges
3   33  male  22.705         0     no  northwest  21984.47061
4   32  male  28.880         0     no  northwest   3866.85520

In [78]:
data.iloc[3:5, 1:5]

    sex     bmi  children smoker
3  male  22.705         0     no
4  male  28.880         0     no

In [ ]:
# ix ==> Old func, label => including to value, index => excluding to value

In [86]:
data.ix[0:3,"sex":"smoker"]

AttributeError: 'DataFrame' object has no attribute 'Ix'

In [85]:
label = pd.Series([4,5,7,8,9], index=[3,4,5,6,7], name="new")

In [87]:
data["label"]= label

In [89]:
data.head(8)

   age     sex     bmi  children smoker     region      charges  label
0   19  female  27.900         0    yes  southwest  16884.92400    NaN
1   18    male  33.770         1     no  southeast   1725.55230    NaN
2   28    male  33.000         3     no  southeast   4449.46200    NaN
3   33    male  22.705         0     no  northwest  21984.47061    4.0
4   32    male  28.880         0     no  northwest   3866.85520    5.0
5   31  female  25.740         0     no  southeast   3756.62160    7.0
6   46  female  33.440         1     no  southeast   8240.58960    8.0
7   37  female  27.740         3     no  northwest   7281.50560    9.0